select 
-- , md5(trim("Содержание счета"."Наименование")), md5(i.item_name)
trim("Содержание счета"."Наименование") as "в счёте", i.item_name "фискальное"
, Счета."ИнтернетЗаказ", Счета."№ счета", p.yam_id
from "Содержание счета"
join "Счета" on Счета."№ счета" = "Содержание счета"."№ счета" 
join yampayment p on p.order_id = Счета."ИнтернетЗаказ"
left join yam_item i on p.yam_id = i.yam_id 
where -- Счета.ps_id=3 and
"Содержание счета"."Кол-во" = item_qnt
and "Содержание счета"."ЦенаНДС" = item_price
and trim("Содержание счета".Наименование) <> trim(item_name)
and Счета."ИнтернетЗаказ" >= 22930
order by Счета."ИнтернетЗаказ"
, "Содержание счета"."КодПозиции"